app/Controllers/News.php

    public function create() {
			$model = model(NewsModel::class);

			if ($this->request->getMethod() === 'post' && $this->validate([
				'title' => 'required|min_length[3]|max_length[255]',
				'body' => 'required',
			])) {

			$avatar = $this->request->getFile('userfile');
			if($avatar->isValid()){
				//$avatar->store();
				$newName = $avatar->getRandomName();
				$avatar->move('asstes', $newName);

			}

			$model->save([
				'title' => $this->request->getPost('title'),
				'slug'  => url_title($this->request->getPost('title'), '-', true),
				'body'  => $this->request->getPost('body'),
				'userfile'  => $newName,
			]);
---
INSERT INTO `news` (`title`, `slug`, `body`, `userfile`) VALUES ('shahin2', 'shahin2', 'asdf', '1655630950_126e82c92cc6c537c9bc.jpg')